# VisGraphicsDesignoptions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VisGraphicsDesignoptions Property
ParameterTypeId Class See Also
---
"V/G Overrides Design Options"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VisGraphicsDesignoptions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VisGraphicsDesignoptions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VisGraphicsDesignoptions {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace